app/controllers/admin/galleries_controller.rb

SELECT * FROM `galleries` WHERE (`galleries`.`id` = 75)
---
  def show
    @gallery = Gallery.find(params[:id])

SELECT * FROM `pages` WHERE (`pages`.`id` = 4)
---
  def new
    @gallery = Gallery.new
    @page = Page.find(params[:page_id])

INSERT INTO `galleries` (`updated_at`, `photo_file_name`, `photo_file_size`, `page_id`, `photo_updated_at`, `photo_content_type`, `created_at`) VALUES('2010-02-05 19:19:00', 'csdesktop.jpg', 184443, 4, '2010-02-05 19:19:00', 'image/jpeg', '2010-02-05 19:19:00')
---
  def create
    @gallery = Gallery.new(params[:gallery])
    @gallery.photo_content_type = MIME::Types.type_for(@gallery.photo_file_name).to_s
    @gallery.page_id = params[:page_id]
    respond_to do |format|
      if @gallery.save