app/controllers/admin/pages_controller.rb

  def edit
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 40)